GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18F27Q83.inc
;----- C1NBTCFGT Bits -----------------------------------------------------
BRP0             EQU  H'0000'
BRP1             EQU  H'0001'
BRP2             EQU  H'0002'
BRP3             EQU  H'0003'
BRP4             EQU  H'0004'
BRP5             EQU  H'0005'
BRP6             EQU  H'0006'
BRP7             EQU  H'0007'


;----- C1DBTCFGL Bits -----------------------------------------------------
SJW0             EQU  H'0000'
SJW1             EQU  H'0001'
SJW2             EQU  H'0002'
SJW3             EQU  H'0003'
SJW0             EQU  H'0000'
SJW1             EQU  H'0001'
SJW2             EQU  H'0002'
SJW3             EQU  H'0003'


;----- C1DBTCFGH Bits -----------------------------------------------------
TSEG20           EQU  H'0000'
TSEG21           EQU  H'0001'
TSEG22           EQU  H'0002'
TSEG23           EQU  H'0003'
TSEG20           EQU  H'0000'
TSEG21           EQU  H'0001'
TSEG22           EQU  H'0002'
TSEG23           EQU  H'0003'


;----- C1DBTCFGU Bits -----------------------------------------------------
TSEG10           EQU  H'0000'
TSEG11           EQU  H'0001'
TSEG12           EQU  H'0002'
TSEG13           EQU  H'0003'
TSEG14           EQU  H'0004'
TSEG10           EQU  H'0000'
TSEG11           EQU  H'0001'
TSEG12           EQU  H'0002'
TSEG13           EQU  H'0003'
TSEG14           EQU  H'0004'


;----- C1DBTCFGT Bits -----------------------------------------------------
BRP0             EQU  H'0000'
BRP1             EQU  H'0001'
BRP2             EQU  H'0002'
BRP3             EQU  H'0003'
BRP4             EQU  H'0004'
BRP5             EQU  H'0005'
BRP6             EQU  H'0006'
BRP7             EQU  H'0007'


;----- C1TDCL Bits -----------------------------------------------------
TDCV0            EQU  H'0000'
TDCV1            EQU  H'0001'
TDCV2            EQU  H'0002'
TDCV3            EQU  H'0003'
TDCV4            EQU  H'0004'
TDCV5            EQU  H'0005'
TDCV0            EQU  H'0000'
TDCV1            EQU  H'0001'
TDCV2            EQU  H'0002'
TDCV3            EQU  H'0003'
TDCV4            EQU  H'0004'
TDCV5            EQU  H'0005'


;----- C1TDCH Bits -----------------------------------------------------
TDCO0            EQU  H'0000'
TDCO1            EQU  H'0001'
TDCO2            EQU  H'0002'
TDCO3            EQU  H'0003'
TDCO4            EQU  H'0004'
TDCO5            EQU  H'0005'
TDCO6            EQU  H'0006'
TDCO0            EQU  H'0000'
TDCO1            EQU  H'0001'
TDCO2            EQU  H'0002'
TDCO3            EQU  H'0003'
TDCO4            EQU  H'0004'
TDCO5            EQU  H'0005'
TDCO6            EQU  H'0006'


;----- C1TDCU Bits -----------------------------------------------------
TDCMOD0          EQU  H'0000'
TDCMOD1          EQU  H'0001'
TDCMOD0          EQU  H'0000'
TDCMOD1          EQU  H'0001'


;----- C1TBC Bits -----------------------------------------------------
TBC0             EQU  H'0000'
TBC1             EQU  H'0001'
TBC2             EQU  H'0002'
TBC3             EQU  H'0003'
TBC4             EQU  H'0004'
TBC5             EQU  H'0005'
TBC6             EQU  H'0006'
TBC7             EQU  H'0007'


;----- C1TBCH Bits -----------------------------------------------------
TBC8             EQU  H'0000'
TBC9             EQU  H'0001'
TBC10            EQU  H'0002'
TBC11            EQU  H'0003'
TBC12            EQU  H'0004'
TBC13            EQU  H'0005'
TBC14            EQU  H'0006'
TBC15            EQU  H'0007'


;----- C1TBCU Bits -----------------------------------------------------
TBC16            EQU  H'0000'
TBC17            EQU  H'0001'
TBC18            EQU  H'0002'
TBC19            EQU  H'0003'
TBC20            EQU  H'0004'
TBC21            EQU  H'0005'
TBC22            EQU  H'0006'
TBC23            EQU  H'0007'


;----- C1TBCT Bits -----------------------------------------------------
TBC24            EQU  H'0000'
TBC25            EQU  H'0001'
TBC26            EQU  H'0002'
TBC27            EQU  H'0003'
TBC28            EQU  H'0004'
TBC29            EQU  H'0005'
TBC30            EQU  H'0006'
TBC31            EQU  H'0007'


;----- C1TSCONL Bits -----------------------------------------------------
TBCPRE0          EQU  H'0000'
TBCPRE1          EQU  H'0001'
TBCPRE2          EQU  H'0002'
TBCPRE3          EQU  H'0003'
TBCPRE4          EQU  H'0004'
TBCPRE5          EQU  H'0005'
TBCPRE6          EQU  H'0006'
TBCPRE7          EQU  H'0007'


;----- C1TSCONH Bits -----------------------------------------------------
TBCPRE0          EQU  H'0000'
TBCPRE1          EQU  H'0001'
TBCPRE8          EQU  H'0000'
TBCPRE9          EQU  H'0001'


;----- C1TSCONU Bits -----------------------------------------------------
TBCEN            EQU  H'0000'
TSEOF            EQU  H'0001'


;----- C1VECL Bits -----------------------------------------------------
ICODE0           EQU  H'0000'
ICODE1           EQU  H'0001'
ICODE2           EQU  H'0002'
ICODE3           EQU  H'0003'
ICODE4           EQU  H'0004'
ICODE5           EQU  H'0005'
ICODE6           EQU  H'0006'


;----- C1VECH Bits -----------------------------------------------------
FILHIT0          EQU  H'0000'
FILHIT1          EQU  H'0001'
FILHIT2          EQU  H'0002'
FILHIT3          EQU  H'0003'
FILHIT4          EQU  H'0004'


;----- C1VECU Bits -----------------------------------------------------
TXCODE0          EQU  H'0000'
TXCODE1          EQU  H'0001'
TXCODE2          EQU  H'0002'
TXCODE3          EQU  H'0003'
TXCODE4          EQU  H'0004'
TXCODE5          EQU  H'0005'
TXCODE6          EQU  H'0006'


;----- C1VECT Bits -----------------------------------------------------
RXCODE0          EQU  H'0000'
RXCODE1          EQU  H'0001'
RXCODE2          EQU  H'0002'
RXCODE3          EQU  H'0003'
RXCODE4          EQU  H'0004'
RXCODE5          EQU  H'0005'
RXCODE6          EQU  H'0006'


;----- C1INTL Bits -----------------------------------------------------
TXIF             EQU  H'0000'
RXIF             EQU  H'0001'
TBCIF            EQU  H'0002'
MODIF            EQU  H'0003'
TEFIF            EQU  H'0004'


;----- C1INTH Bits -----------------------------------------------------
TXATIF           EQU  H'0002'
RXOVIF           EQU  H'0003'
SERRIF           EQU  H'0004'
CERRIF           EQU  H'0005'
WAKIF            EQU  H'0006'
IVMIF            EQU  H'0007'


;----- C1INTU Bits -----------------------------------------------------
TXIE             EQU  H'0000'
RXIE             EQU  H'0001'
TBCIE            EQU  H'0002'
MODIE            EQU  H'0003'
TEFIE            EQU  H'0004'


;----- C1INTT Bits -----------------------------------------------------
TXATIE           EQU  H'0002'
RXOVIE           EQU  H'0003'
SERRIE           EQU  H'0004'
CERRIE           EQU  H'0005'
WAKIE            EQU  H'0006'
IVMIE            EQU  H'0007'


